yassinechouk/Elyssa-dev-board/platform/boards.txt
##############################################################
#  Moovma Elyssa - ESP32-S3FN8 (8 MB embedded flash, no PSRAM)
#
#  USB: two modes, selected in the Tools menu.
#   MODE 1 (default, everyday): USB-OTG (TinyUSB)
#     Windows and the IDE show the board as "Elyssa" (303A:81FF).
#   MODE 2 (debug): Hardware CDC and JTAG
#     Change BOTH menus:  USB Mode    -> Hardware CDC and JTAG
#                         Upload Mode -> UART0 / Hardware CDC
#     Windows shows "USB JTAG/serial debug unit" (303A:1001), the IDE shows "Elyssa".
#     Boot logs, crash messages and JTAG debugging are available.
#
#  RULE: in every menu, the FIRST option listed is the default.
#  RULE: menu option keys (e.g. "8M", "cdc") are a contract:
#        renaming/removing one breaks users who had it selected.
##############################################################

# Menus used by Elyssa (only these; everything else removed)
menu.UploadSpeed=Upload Speed
menu.USBMode=USB Mode
menu.CDCOnBoot=USB CDC On Boot
menu.MSCOnBoot=USB Firmware MSC On Boot
menu.DFUOnBoot=USB DFU On Boot
menu.UploadMode=Upload Mode
menu.CPUFreq=CPU Frequency
menu.FlashMode=Flash Mode
menu.FlashSize=Flash Size
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.LoopCore=Arduino Runs On
menu.EventsCore=Events Run On
menu.EraseFlash=Erase All Flash Before Sketch Upload
menu.JTAGAdapter=JTAG Adapter
menu.PSRAM=PSRAM

##############################################################

elyssa.name=Elyssa

# --- USB identity for automatic board detection -------------
# MODE 1 (TinyUSB). TEMPORARY PID for local tests only. Replace with the PID
# assigned by Espressif (github.com/espressif/usb-pids).
# MUST be identical to USB_PID in variants/elyssa/pins_arduino.h
elyssa.upload_port.0.vid=0x303A
elyssa.upload_port.0.pid=0x81FF
# MODE 2 (Hardware CDC and JTAG) and ROM download mode: VID/PID fixed in the
# ESP32-S3 silicon, shared by every ESP32-S3/C3/C6/H2 in this mode.
elyssa.upload_port.1.vid=0x303A
elyssa.upload_port.1.pid=0x1001

# --- Tools --------------------------------------------------
elyssa.bootloader.tool=esptool_py
elyssa.bootloader.tool.default=esptool_py
elyssa.upload.tool=esptool_py
elyssa.upload.tool.default=esptool_py
elyssa.upload.tool.network=esp_ota

# --- Upload defaults (TinyUSB: reset via 1200 bps touch) ----
elyssa.upload.maximum_size=3342336
elyssa.upload.erase_cmd=
elyssa.upload.maximum_data_size=327680
elyssa.upload.flags=
elyssa.upload.extra_flags=
elyssa.upload.use_1200bps_touch=true
elyssa.upload.wait_for_upload_port=true

elyssa.serial.disableDTR=false
elyssa.serial.disableRTS=false

# --- Chip and board -----------------------------------------
elyssa.build.tarch=xtensa
elyssa.build.bootloader_addr=0x0
elyssa.build.target=esp32s3
elyssa.build.mcu=esp32s3
elyssa.build.core=esp32
elyssa.build.variant=elyssa
elyssa.build.board=ELYSSA

# --- USB defaults: TinyUSB + Serial over USB ----------------
elyssa.build.usb_mode=0
elyssa.build.cdc_on_boot=1
elyssa.build.msc_on_boot=0
elyssa.build.dfu_on_boot=0

# --- CPU / flash: fixed by the hardware (FN8 = 8 MB quad) ---
elyssa.build.f_cpu=240000000L
elyssa.build.flash_size=8MB
elyssa.build.flash_freq=80m
elyssa.build.flash_mode=dio
elyssa.build.boot=qio
elyssa.build.boot_freq=80m
elyssa.build.partitions=default_8MB
elyssa.build.defines=
elyssa.build.loop_core=
elyssa.build.event_core=

# No PSRAM on the FN8 (see the single-option PSRAM menu below)
elyssa.build.psram_type=qspi
elyssa.build.memory_type={build.boot}_{build.psram_type}

##############################################################
#  MENUS (first option = default)
##############################################################

# USB mode: MODE 1 TinyUSB (default) gives the board its "Elyssa" identity.
# MODE 2 Hardware CDC and JTAG: also set Upload Mode to "UART0 / Hardware CDC".
elyssa.menu.USBMode.default=USB-OTG (TinyUSB)
elyssa.menu.USBMode.default.build.usb_mode=0
elyssa.menu.USBMode.hwcdc=Hardware CDC and JTAG
elyssa.menu.USBMode.hwcdc.build.usb_mode=1

elyssa.menu.CDCOnBoot.cdc=Enabled
elyssa.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
elyssa.menu.CDCOnBoot.default=Disabled (Serial on UART0 header pins)
elyssa.menu.CDCOnBoot.default.build.cdc_on_boot=0

elyssa.menu.MSCOnBoot.default=Disabled
elyssa.menu.MSCOnBoot.default.build.msc_on_boot=0
elyssa.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
elyssa.menu.MSCOnBoot.msc.build.msc_on_boot=1

elyssa.menu.DFUOnBoot.default=Disabled
elyssa.menu.DFUOnBoot.default.build.dfu_on_boot=0
elyssa.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
elyssa.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

# MODE 1: USB-OTG CDC (1200 bps touch).  MODE 2: UART0 / Hardware CDC (DTR/RTS reset)
elyssa.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
elyssa.menu.UploadMode.cdc.upload.use_1200bps_touch=true
elyssa.menu.UploadMode.cdc.upload.wait_for_upload_port=true
elyssa.menu.UploadMode.default=UART0 / Hardware CDC
elyssa.menu.UploadMode.default.upload.use_1200bps_touch=false
elyssa.menu.UploadMode.default.upload.wait_for_upload_port=false

# Only 8 MB schemes (the chip has exactly 8 MB)
elyssa.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
elyssa.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
elyssa.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
elyssa.menu.PartitionScheme.default_ffat_8MB=8M with ffat (3MB APP/1.5MB FATFS)
elyssa.menu.PartitionScheme.default_ffat_8MB.build.partitions=default_ffat_8MB
elyssa.menu.PartitionScheme.default_ffat_8MB.upload.maximum_size=3342336
elyssa.menu.PartitionScheme.large_spiffs_8MB=8M large SPIFFS (1.25MB APP/5.3MB SPIFFS)
elyssa.menu.PartitionScheme.large_spiffs_8MB.build.partitions=large_spiffs_8MB
elyssa.menu.PartitionScheme.large_spiffs_8MB.upload.maximum_size=1310720
elyssa.menu.PartitionScheme.max_app_8MB=8M max app, no OTA (7.9MB APP)
elyssa.menu.PartitionScheme.max_app_8MB.build.partitions=max_app_8MB
elyssa.menu.PartitionScheme.max_app_8MB.upload.maximum_size=8257536

# No PSRAM on the FN8. Menu kept with ONE option so that IDEs which
# remember "PSRAM=disabled" from the old package don't fail with
# "invalid option 'PSRAM'" (backward compatibility).
elyssa.menu.PSRAM.disabled=Disabled (no PSRAM on ESP32-S3FN8)
elyssa.menu.PSRAM.disabled.build.defines=
elyssa.menu.PSRAM.disabled.build.psram_type=qspi

# Kept as a single fixed entry so old sketches with FlashSize=8M still work
elyssa.menu.FlashSize.8M=8MB (64Mb)
elyssa.menu.FlashSize.8M.build.flash_size=8MB

# Quad flash only: OPI and QIO 120MHz removed
elyssa.menu.FlashMode.qio=QIO 80MHz
elyssa.menu.FlashMode.qio.build.flash_mode=dio
elyssa.menu.FlashMode.qio.build.boot=qio
elyssa.menu.FlashMode.qio.build.boot_freq=80m
elyssa.menu.FlashMode.qio.build.flash_freq=80m
elyssa.menu.FlashMode.dio=DIO 80MHz
elyssa.menu.FlashMode.dio.build.flash_mode=dio
elyssa.menu.FlashMode.dio.build.boot=dio
elyssa.menu.FlashMode.dio.build.boot_freq=80m
elyssa.menu.FlashMode.dio.build.flash_freq=80m

elyssa.menu.CPUFreq.240=240MHz (WiFi)
elyssa.menu.CPUFreq.240.build.f_cpu=240000000L
elyssa.menu.CPUFreq.160=160MHz (WiFi)
elyssa.menu.CPUFreq.160.build.f_cpu=160000000L
elyssa.menu.CPUFreq.80=80MHz (WiFi)
elyssa.menu.CPUFreq.80.build.f_cpu=80000000L

elyssa.menu.UploadSpeed.921600=921600
elyssa.menu.UploadSpeed.921600.upload.speed=921600
elyssa.menu.UploadSpeed.115200=115200
elyssa.menu.UploadSpeed.115200.upload.speed=115200

elyssa.menu.DebugLevel.none=None
elyssa.menu.DebugLevel.none.build.code_debug=0
elyssa.menu.DebugLevel.error=Error
elyssa.menu.DebugLevel.error.build.code_debug=1
elyssa.menu.DebugLevel.warn=Warn
elyssa.menu.DebugLevel.warn.build.code_debug=2
elyssa.menu.DebugLevel.info=Info
elyssa.menu.DebugLevel.info.build.code_debug=3
elyssa.menu.DebugLevel.debug=Debug
elyssa.menu.DebugLevel.debug.build.code_debug=4
elyssa.menu.DebugLevel.verbose=Verbose
elyssa.menu.DebugLevel.verbose.build.code_debug=5

elyssa.menu.LoopCore.1=Core 1
elyssa.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
elyssa.menu.LoopCore.0=Core 0
elyssa.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

elyssa.menu.EventsCore.1=Core 1
elyssa.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
elyssa.menu.EventsCore.0=Core 0
elyssa.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

elyssa.menu.EraseFlash.none=Disabled
elyssa.menu.EraseFlash.none.upload.erase_cmd=
elyssa.menu.EraseFlash.all=Enabled
elyssa.menu.EraseFlash.all.upload.erase_cmd=-e

# JTAG Adapter: this menu has NO effect with core 3.3.x. The IDE's Debug
# button always uses the built-in USB JTAG (debug_script.esp32s3 in
# platform.txt). Kept only because option keys are a contract.
# Debugging requires MODE 2 (Hardware CDC and JTAG), plus the tools
# openocd-esp32 and xtensa-esp-elf-gdb (not yet declared in the index).
# External FTDI / bridge removed: JTAG pins (GPIO39-42) are not routed on Elyssa.
elyssa.menu.JTAGAdapter.default=Disabled
elyssa.menu.JTAGAdapter.default.build.copy_jtag_files=0
elyssa.menu.JTAGAdapter.builtin=Integrated USB JTAG
elyssa.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
elyssa.menu.JTAGAdapter.builtin.build.copy_jtag_files=1